[
  {
    "path": "posts/2021-01-27-dataviz1/",
    "title": "DataViz1",
    "description": "ISSS608 Visual Analytics and Applications – DataViz Makeover 1",
    "author": [
      {
        "name": "EvelynPhang",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n1. Link to Visualisation (Tableau)\r\nhttps://public.tableau.com/profile/evelynphanghuiwen#!/vizhome/DataViz1_16117030016390/AgeGroupDistribution?publish=yes\r\n2. Original Visualisation:\r\n[Original]\r\n3a.Critic the Graph for Clarity and Aesthetics.\r\n3b. Suggestions for Improvement\r\nCritique3c. Using Tableau, design the proposed data visualization\r\nStep03d. Provide step-by-step description on how the data visualization was prepared\r\n3d.1 Data Exploration\r\nData Exploration – identifying the correct data source for the objective\r\nTableau is effective when using data that is structured. Each row is an item of data, and each column is an attribute.\r\nObjective: To achieve the purpose to show composition of different residents age-group – as part of total resident workforce.\r\nReviewing relevant table: Based on the diagram and looking in the report, if was realised that the data used for the chart is actually a calculated field from the data columns in Table 7 instead of Table 5 in the assignment reference.\r\nDownload Table 7 from the report, and delete the extra tabs for Male and Female as this into used in the analysis.\r\nMOM Data Table 7 :https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx\r\n3d.2 Create the new data required from the existing worksheet.\r\nEvaluate the Table 7 to find out how to compute the % contribution to the workforce for that age group.\r\nTable71)Add a new worksheet ‘calculated’ - that computes the % contribution to the workforce for each group, using the data from T7_T tab in the excel.\r\n2)Each of the field above is computed based on the relevant fields Eg. For 2009, the Age Group contribution for 15-19 is [Age-Group[15-19]-workforce-for-the-year]/[Total-workforce-for-the-year]= 31.8/1985.7 = 1.6%.\r\n3)The “calculated” provides the required data for the chart: ( leveraging Excel or Tableau Prep).\r\ncalculated3d.3 Implement a Bar Chart Visualisation for the calculated Sheet\r\n For the 2009 chart, change the x-axis to have a reversed scale. \r\n3d.4 Update the Marks of the colour 2009/2019 % -using the gradient color selection\r\nUse the 2009 and 2019 data, input to the ‘colours’ tab for both columns – 2009 and 2019.\r\nFor both the colour ranges for 2009/2019, configure the i)6 color steps ii)select color gradient Red-Gold iii)Configure the same Start and End ( 0, 15 ).\r\ndashboard3d.5 Adding and Fine Tuning Labelling, Captions,Font,Font Size\r\ndashboard3d.6 Dashboard and Annotation to help the users capture the information\r\ndashboardCreate a Dashboard – and add an annotation for the key observation that the % contribution for Age Group to the workforce, has increased for Age Group >50 years old. To make the years clearer, add a pane background to show the distinction between Year 2009 and Year 2019.\r\n4. Final DataViz and Top Three insights from DataViz\r\nMain Objective: My DataViz wants to communicate the composition of workforce base on age-group % of the workforce showing the change over the 10 years from 2009 to 2019 as the key objective. (Other info such as male vs female, change in absolute size of workforce is also interesting but is not addressed within this assignment).\r\n1st Insight : Between 2009 and 2019, the distribution of % of workforce remained largely the same with the age groups 35-49 contributing the largest percentages. [ Judging from the three longest bars of the chart for both June 2009 and June 2019].\r\nHighlight12nd Insight: There is a significant increase in the percentage contributed by the age group from 55 and beyond. [ Judging from clearly longer bars, and significant change in color on the right side of the chart ].\r\n3rd Insight: The is a slight decrease in the percentage of increase contributed by the age group from 55 and below. [ Judging from clearly longer bars, and significant change in colour on the right side of the chart ].\r\nHighlight3\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T03:02:17+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-19-dataviz2/",
    "title": "DataViz2",
    "description": "ISSS608 Visual Analytics and Applications – DataViz Makeover 2",
    "author": [
      {
        "name": "EvelynPhang",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n1. Link to Visualisation (Tableau)\r\nhttps://public.tableau.com/profile/evelynphanghuiwen#!/vizhome/DataViz2EvelynPhang_16136603094040/DivergentVAC1?publish=yes\r\n2. Original Visualisation:\r\nOriginal3a.Critic the Graph for Clarity and Aesthetics.\r\n3b. Suggestions for Improvement\r\nCritique-clarityCritique-aesthetics3c.1 Sketch Out the Proposed Design\r\nStep0Chart 1 : Choice of Chart :Divergent Stack Bar\r\nThis is the best choice for communicating survey results that was in in the form of a Likert scale [ (Likert 1932), which consists of a discrete number of choices per question among the sequence: “Strongly Disagree”, “Disagree”, “No Opinion”, “Agree”, “Strongly Agree”].In a Likert Scale that has 5 options, the positive responses will include the top 2 options – Strongly Agree and Agree.\r\nAdditional Filter for Demographics: To allow the user to select view of this data based on certain social-demographics, we should implement a selectable filer ( Multiple Selection Dropdown List) for the user to select.\r\nChart 2: Attitudes in Vaccination : Divergent Stack Bar\r\nThe data source provided additional survey questions, that provider deeper insights of possible reasons why people may accept or not accept the vaccine. I will leverage 4 of this survey from the same source : but from the survey tables vac2_1,2_2,2_3,2_6 – to create the Likert scale response in the form of a Divergent Stack Bar – that will also be used as a TOOLTIP of Chart 1. Same Filters must apply for demographics ( also when presented in the Tooltip ).\r\nChart 3 : Agree/Strongly Agree – Bar Chart\r\nI will implement a bar chart for the two Scores – Agree/StronglyAgree instead of just a bar chart for “Strongly Agree”. In a Likert Scale survey, the top 2 choices are both as indicative of positive choices.\r\nChart 4 : Agree/Strongly Agree – Error Bar/Confidence Bar – to address uncertainty\r\nThis chart is used to illustrate the fact that depending on the quality of the samples and the number of samples taken, the data presented by the charts – may not have a high confidence of certainty. To illustrate this, I will plot the Agree/Strongly Agree – confidence scores for both 95% and 99% in the same chart to illustrate the part.\r\n3c.2 Using Tableau, design the proposed data visualization\r\n3d. Provide step-by-step description on how the data visualization was prepared\r\n3d.1 Data Exploration and Data Cleansing\r\nData Exploration – identifying the correct data source for the objective.Tableau is effective when using data that is structured. Each row is an item of data, and each column is an attribute. For the purpose of this assignment, I stick with the 15 countries analysed in the original visualiation:Australia,Canada,Denmark,Finland,France,Germany,Italy,Japan,Netherlands,Norway,Singapore,South-Korea,Sweden,United Kingdom.\r\nData Prep Step 1 :\r\nImport the data and create the new data required from the existing country worksheets.\r\nCreate a new Union – of all the excel of the 15 countries. Except for the columns in the right panel, hide all other columns\r\nDataPrepStep1Export the filtered columns into a new excel AllCountries00.xls and start a new Tableau Project.\r\nData Prep Step 2 :Import the file from the previous steps and continue data prep.\r\n1)TableName – split this attribute, to create a new column that is renamed  . The reason for doing this is to extract just the word  from the table name .xls\r\n2)Rename some attributes Rename the attribute Household Size to “Size of Household” Rename the attribute “Household Children” to “Children in household”\r\n3)Create numerical version of the survey response using this logic. Apply this to all survey response, VAC_1, VAC_2, VAC_3, VAC2_1, VAC2_2, VAC2_3, VAC_\r\n Do this to create new numeric fields from the original character fields: VAC_1_num, VAC_2_num, VAC_3_num, VAC2_1_num, VAC2_2_num, VAC2_3_num, VAC_6_num. 4)Hide the original string based VAC data. VAC_1, VAC_2, VAC_3, VAC2_1, VAC2_2, VAC2_3, VAC_6. 5)Pivot on the new fields: VAC_1_num, VAC_2_num, VAC_3_num, VAC2_1_num, VAC2_2_num, VAC2_3_num, VAC_6_num.\r\nData Prep Step 3 : Select all VAC columns for pivot\r\nDataPrepStep4Rename the Pivoted columns as : “Survey” and “Score”, and change the data type for score to ‘integer whole’.\r\nData Prep Step 4 : Build the needed Calculated Fields\r\nCalculatedFields1Data Prep Step 5 : Create Some Meaningful Aliases\r\nFor all the scores create the value alias \r\nFor the sub-surveys create the survey alias  For the countries , as these are names ( proper nouns) , create alias with the Country names – starting with capital letters.\r\nDataPrepStep53d.2 Building the required Charts\r\nBuilding Chart 1 : Survey output of VAC1_Num \r\nKey Steps :\r\n1)Adding Gantt Percent to the Columns – select compute using score 2)Adding ‘Countries’ to the Row – select sort by ‘Count Agree’ 3)Add Survey to the Filter (Edit Filter- and select VAC1num) 4)Add Score to the Filter (Edit Filter- Select all except Null ) 5)Add Gender to the Filter (Edit Filter - Select ‘Male’ and ‘Female’ ) 6) Add Size of Household to the Filter– select all 8) Add Children of Household to the Filter– select all 9) Add Employment Status to the Filter– select all 10) Add Age to the Filter – ensure that it is a ‘continuous’ dimension. 11) In Marks – select “Gantt Bar”\r\n 12)Format the X-axis – Scale- Numbers : Percentage with 0 decimal space\r\n13)Configure the colours of the Divergent Chart – using two shades of the same colour for positives (Strongly Agree,Agree ) and two shades of the another colour for negatives ( Strongly Disagree, Disagree ) and lighter colour for neutral.\r\n 13)Add a reference line at 0% for the X-axis, Value =0 and Constant, with Label=Custom, 0%\r\n 14)Configure all Filters to “Show Filter”.As they showup on the right panel , configure them as “Multiple Value” Dropdown, except for the AGE filter, which is a continuous range slider.\r\n15)Implement formatting to the chart:\r\nSelect on the Menu bar, Format, Workbooktheme, Modern\r\nSelect on the Menu bar, Format, Lines, Gridlines, select to middle grey.\r\nChange the title to : Respond to Survey Question : \" If a Covid-19 vaccine were made available to me this week, I would definitely get it\"\r\n16)Turn on animation.\r\nChart1_617)Rename the first chart as “Divergent VAC1”.\r\nBuilding Chart 2 : Attitudes of Vaccination \r\nKey Steps;\r\n1)Implement a new chart called “Attitudes of Vaccination” -using the data from the survey question VAC2_1,VAC2_2,VAC2_3,VAC2_6. To do this, first duplicate the first chart “Divergent VAC1”. For this second chart rename it “All attitudes”.\r\n2)Based on the duplicated and renamed chart, -Move the “Country” pill back into the shelf. -Move the “Survey” pill from the shelf into row\r\n3)Edit the Filter for the ‘Survey’ pill in the Filter Shelf to show only the four – sub attitudes. 5)Rename the title of this second chart to : Attitudes Towards Vaccination by All\r\n\r\nUpdating Chart 1 : Adding the Tooltip \r\n18)Go back to the First Chart, and implement the following Tooltip.\r\n The resulting outcome is as follows :\r\nChart1_9Building Chart 3 : Agree/StronglyAgree Error/Confidence Bars \r\nDuplicate the Sheet “Divergent VAC1”. Rename the new sheet as “Agree/Strongly Agree Error Bars”.\r\nStep 1 : Implement the following new ‘Calculated’ fields to achieve the Error bar chart.\r\nCalculated FieldsStep 2 : Repopulate the “Columns” with Measure Values, and then Prop In the “Filter” Shelf, Edit the Filter for Measure Values to show only : Prop_Lower Limit 95% Prop_Upper Limit 95% Prop_Lower Limit 99% Prop_Upper Limit 99%\r\nChart1_9Step 3 : In the MARKS card, for “Measure Values” , select type “Line” and add Measure Values into ‘Colour’,’Size’,’Path’,’Detail’\r\nStep 4 : In the MARKS card, configure “AGG(PROP)” to be type “Circle” and add ‘Measure Names’ into detail, and (CNT)Number of Records into the Tooltip\r\nChart1_9Step 5 : Updating the MARKS Card\r\nIn the MARKS card, for “Measure Values”, configure “Tooltip” as follows : Country: : \r\nIn the MARKS card, for “AGG(PROP)”, configure “Tooltip” as follows : Measure Names:  Country:  Prop: <AGG(Prop)> Number of Records : <CNT(Number of Records)>\r\nAdjust the Colours as follows in the “MARK” tray and set Opacity to “50%”. \r\nStep 6 : Drop the ‘PROP’ from column, into the chart again as a second X-Axis “at the top”. Synchronize the Axis.\r\n Step 7 : Configure the right panel to show only the Filters for : “Survey” and “MeasureValues” so that we can configure which survey the chart is displaying, and also Confidence upper bound and lower bounds we want to view.\r\n Rename the title of this chart – shows that it ‘dynamically’ reflects the results for the appropriate survey.\r\nStep 8 : Rename the title of this chart – shows that it ‘dynamically’ reflects the results for the appropriate survey.\r\nBuilding Chart 5 : Agree/StronglyAgree Error/Confidence Bars \r\nDuplicate the “Divergent VAC1” sheet , and rename it as Agree/Strongly Agree Bar Chart.\r\nRemove everything in Column and populate with “Strongly Agree” Measure Value, Format this as “Percentage” with 2 decimal places. Remove everything in Row and populate with “Country”. In Marks, remove everything, and then Add “Score” into colour. In Marks, change the chart type to “Bar”.\r\nImplement the following tool tip: \r\nResult implementation is as below: \r\nRename the title of this chart – shows that it ‘dynamically’ reflects the results for the appropriate survey. \r\nAs a last step, add the source references to all Charts. Source : Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub https://github.com/YouGov-Data/covid-19-tracker\r\n4. Final DataViz and Top Three insights from DataViz\r\n4.1 Main Objective\r\nMy DataViz wants to communicate the attitudes towards taking Covid19 vaccination- based on the ( Source : Source : Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub ) to highlight 1) Differences in attitudes between Countries 2) Differences in attitudes between now and 1 year from now 3) Highlight how the data source is reliable or show the confidence level of the data\r\n4.2 Final DataViz\r\nChart 1 : Divergent Bar Chart of Survey Response : Getting the Vaccine Available Now\r\n Chart 2 Divergent Bar Chart of Survey Response : Getting the Vaccine Available Now with Tool Tip\r\nChart2Chart 3: Divergent Bar Chart of Survey Response : Getting the Vaccine Available One Year from Now with Tool Tip\r\n Chart 4 : Divergent Bart Chart on Attitudes on Vaccination\r\n Chart 5: Agree/Strongly Agree – Error Bars - 95%/99% confidence\r\n Chart 6: Agree/Strongly Agree – Bar Charts\r\nChart64.3 Key Insights\r\n1st Insight :Asian Countries were in general less receptive to the vaccine and attitudes about taking the vaccine one year from today did not change much\r\nInsigh1UK has the highest number of people who are willing to take the vaccination as soon as possible, and in deeper dive we can see that they have strong confident in the health authorities( > 60%), and at the same time low fear of side effects ( < 50% ). All the Asian countries had low willingness to take the vaccination. When I further compared this with the attitude one year from now, there was no significant change in willingness to accept the vaccine.\r\nInsigh1aTHe opinion about willingness to accept the Vaccine did not change significantly if it was offered to be available one year later instead of in 1 week’s time.\r\n2nd Insight:People’s Willingness to accept vaccine, can be explained by their fear/worry about the Vaccine/Covid-19\r\nInsight1The countries that were most worried about the side effects of the vaccine, and are worried about getting Covid19- are the two North Asia Countries Japan and South Korea. Not surprisingly people in the UK and Denmark are the least worried, and are thus also in the top 5 countries most willing to accept the vaccine.\r\n3rd Insight:From the same data sources,data from different ranges may have different certainty/confidence \r\nAs the oldest people are the most vulnerable, it is important for most governments that they are vaccinated first. Based on Chart 1, across all countries, for the age group from 70 and beyond, compared to the general population a significant percentage of people who are prepared to accept the vaccine.\r\n From the chart above, across all countries – Top 5 countries have positive responses in the range of 50% to 70%- when considering participants from all age group\r\nInsight3From the next chart above, across all countries – Top 5 countries have positive responses in the range of 70% to 85% when considering participants from age group between 70 to 99.\r\nBut….is this really the truth ?\r\nBy looking at the Error Bar/Confidence chat, we discover that the confidence interval for this ‘older age group range’ is actually much lower compared to the original data. Take for eg Singapore at 95% confidence, the percentage of people who indicated agree/strongly-agree ranged from 26% to 44% - for those in the age group 70 to 99 compared to 32% to 35% if considering all ages. See the two charts below.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T05:46:56+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-27T13:07:46+08:00",
    "input_file": {}
  }
]
